services/course-service/test-soap-requests/08-get-course-with-schedules.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cou="http://courses.universite.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <cou:getCourseWithSchedules>
         <id>1</id>
      </cou:getCourseWithSchedules>
   </soapenv:Body>
</soapenv:Envelope>
